In [29]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model

In [32]:
df = pd.read_csv("./Datasets/hiring.csv")
df.head()

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000

In [31]:
for i in range(df.shape[0]):
    df.iloc[:, i:i+1] = df.iloc[:, i:i+1].fillna(df.iloc[:, i:i+1].mean())
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0    6.333333               8.000000                           9      50000
1    6.333333               8.000000                           6      45000
2    5.000000               6.000000                           7      60000
3    2.000000              10.000000                          10      65000
4    7.000000               9.000000                           6      70000
5    3.000000               7.000000                          10      62000
6   10.000000               7.857143                           7      72000
7   11.000000               7.000000                           8      80000

In [33]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')
imputer.fit(df.iloc[:, :-1])
df.iloc[:, :-1] = imputer.transform(df.iloc[:, :-1])
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0    6.333333               8.000000                         9.0      50000
1    6.333333               8.000000                         6.0      45000
2    5.000000               6.000000                         7.0      60000
3    2.000000              10.000000                        10.0      65000
4    7.000000               9.000000                         6.0      70000
5    3.000000               7.000000                        10.0      62000
6   10.000000               7.857143                         7.0      72000
7   11.000000               7.000000                         8.0      80000

In [35]:
model = linear_model.LinearRegression()
model.fit(df.iloc[:, :-1], df.iloc[:, -1:])

LinearRegression()

In [37]:
model.predict([[2,9,6]])

array([[47738.89104313]])